[
  {
    "id": "1",
    "title": "Swyvvl Real Estate Platform",
    "description": "Swyvvl aimed to transform the real estate industry by creating a transparent, efficient platform connecting home buyers, sellers, agents, and mortgage lenders. I designed and developed a responsive, user-friendly website featuring MLS listings, commission-sharing tools, and instant connections with agents and lenders, all while ensuring legal compliance and aligning with Swyvvl's innovative vision.",
    "slug": "swyvvl-real-estate-platform",
    "images": {
      "thumbnail": {
        "url": "/projects/swyvvl-real-estate-platform/thumbnail.jpg",
        "alt": "Swyvvl Real Estate Platform interface"
      },
      "gallery": []
    },
    "websiteUrl": "https://www.swyvvl.com/",
    "featured": 1,
    "status": "published",
    "content": {
      "challenge": "Swyvvl needed a standout online presence in the crowded real estate market—one that streamlined the buying and selling process, empowered users with equitable tools, and connected agents and lenders directly to clients. The platform required a mobile-friendly design, an intuitive MLS listings interface, commission-sharing functionality, and seamless stakeholder connections, all built with legal compliance in mind.",
      "approach": "As the sole full-stack developer, I crafted a visually engaging, responsive website from the ground up. I leveraged Webflow for the frontend, Xano for the backend, and Wized as middleware to handle data requests and actions. Memberstack powered membership management, while Stripe enabled secure payment processing for premium features. I integrated a feedback system for the Full Beta launch to refine the platform based on real user input and met regularly with stakeholders to report progress, gather insights, and prioritize user experience. Throughout, I ensured strict adherence to legal standards.",
      "solution": "The result was a robust, user-centric platform that embodied Swyvvl's forward-thinking approach. I designed and developed every aspect—frontend and backend—delivering detailed MLS listings, personalized member dashboards, and gated content. By diving into API documentation, I built custom API requests to integrate third-party tools and enhance functionality. I owned the entire development process, collaborating closely with stakeholders to align the platform with their goals while advocating for usability and performance. Post-launch, I've continued to enhance the site, implementing features like an MLS listing home search powered by APIs and displaying dynamic listings on the frontend.",
      "results": "Since launch, Swyvvl's platform has driven impressive results. The intuitive design and instant connection features boosted user engagement, while the commission-sharing model and transparent transactions increased inquiries and conversions. Detailed MLS listings empowered better decision-making for buyers and sellers alike. Feedback from the Full Beta launch was overwhelmingly positive, guiding ongoing improvements. My work positioned Swyvvl as an innovative leader in real estate, strengthening stakeholder connections and fueling growth—all while I continue to evolve the platform with new features and optimizations."
    },
    "tools": [
      "html-css",
      "javascript",
      "figma",
      "webflow",
      "adobe-illustrator"
    ],
    "metadata": {
      "bgColor": "#0042cc",
      "mockupBgColor": "#e9e9e9"
    }
  },
  {
    "id": "2",
    "title": "Modern Day Sniper",
    "description": "Collaborated on a modern ecommerce frontend and later designed a membership dashboard for Modern Day Sniper (MDS), enhancing their platform with user-focused design and AI-driven features to boost engagement and learning.",
    "slug": "modern-day-sniper",
    "images": {
      "thumbnail": {
        "url": "/projects/modern-day-sniper/gallery-1742616913778-0.png",
        "alt": "www.moderndaysniper.com_events.png",
        "isFeatured": true
      },
      "gallery": [
        {
          "url": "/projects/modern-day-sniper/gallery-1742616913778-0.png",
          "alt": "www.moderndaysniper.com_events.png",
          "isFeatured": true
        }
      ]
    },
    "websiteUrl": "http://www.moderndaysniper.com/",
    "featured": 2,
    "status": "published",
    "content": {
      "challenge": "MDS needed a polished ecommerce platform and, years later, an upgraded membership experience to support their growing online courses. Initially, I helped a freelance developer craft their site; as their brand evolved, they rehired me to refine the member dashboard and plan AI tools—requiring seamless design, intuitive navigation, and personalized engagement for subscribed users.",
      "approach": "I leaned on collaboration and client relationships, working closely with developers, the owner, and stakeholders. Initially partnered with a developer to create a modern frontend for their ecommerce platform, delivering prototypes and user flows for checkout. Later designed an intuitive member dashboard, consulting on layout and usability as their courses expanded.",
      "solution": "I delivered phased improvements including a clean, responsive design with a streamlined checkout process, setting a strong foundation. The member dashboard featured a user-friendly interface for course access, enhanced by ongoing features like a Map Search page for shooting ranges. AI Integration included consulting on an AI chatbot for navigation and learning snippets, plus analytics to personalize member experiences.",
      "results": "The collaboration yielded steady growth with stronger engagement, increased sign-ups and retention, driven by an intuitive ecommerce flow and course platform. Positive feedback from members and stakeholders on usability and AI potential fueled confidence in its future."
    },
    "tools": [
      "adobe-illustrator",
      "adobe-photoshop",
      "figma",
      "webflow"
    ],
    "metadata": {
      "bgColor": "#736f44",
      "mockupBgColor": "#9f9e7c"
    }
  },
  {
    "id": "3",
    "title": "Off The Leash Lifestyle",
    "description": "I transformed Off The Leash Lifestyle—founded by pro paintball players—into a vibrant e-commerce and membership hub. I revamped their outdated website into a modern, action-driven platform for merchandise, training, and coaching sales, then expanded it with Basecamp, an exclusive subscription program offering tailored fitness and wellness resources.",
    "slug": "off-the-leash-lifestyle",
    "images": {
      "thumbnail": {
        "url": "/projects/off-the-leash-lifestyle/thumbnail.jpg",
        "alt": "Off The Leash Lifestyle website"
      },
      "gallery": []
    },
    "websiteUrl": "https://www.offtheleashlifestyle.com",
    "featured": 3,
    "status": "published",
    "content": {
      "challenge": "Off The Leash Lifestyle's static website didn't reflect their energetic brand or support their growing ambitions. They needed a high-converting e-commerce platform with seamless social media integration to sell merchandise, classes, and coaching, plus a scalable foundation for Basecamp—a gated membership delivering training videos, nutrition guides, and workout plans. The dual goal was to boost sales and create an engaging, user-friendly subscription experience.",
      "approach": "I tackled the project in two phases, collaborating with stakeholders to align with their vision. After researching top e-commerce trends, I designed prototypes in Figma and developed a mobile-first platform using Webflow. Key features included a dynamic homepage with motion graphics, \"featured drop\" product sections tied to social media, and engaging visuals to drive conversions.",
      "solution": "I designed and developed a dual-purpose platform with an animated homepage with a logo embodying the \"no leash\" ethos, \"featured drop\" section synced with social campaigns to spike sales, and responsive design with videos and social sharing, optimized for mobile traffic.",
      "results": "Sales surged with \"featured drops\" tied to social media launches. Animations and videos boosted engagement and time on site. Mobile optimization increased traffic from social platforms. Rapid membership growth built a loyal fitness community. Regular updates and intuitive dashboards improved retention."
    },
    "tools": [
      "figma",
      "adobe-illustrator",
      "webflow",
      "html-css",
      "javascript"
    ],
    "metadata": {
      "bgColor": "hsla(0, 0.00%, 60.00%, 1.00)",
      "mockupBgColor": "hsla(0, 0.00%, 64.31%, 1.00)"
    }
  },
  {
    "id": "4",
    "title": "Kosei Performance Partners",
    "description": "I crafted a unique, culturally resonant brand and responsive website for Kosei Performance Partners, a mentorship agency for professional athletes. Inspired by their Japanese roots, I designed a Kanji-inspired logo and built a mobile-friendly platform showcasing athlete profiles, partnerships, and video highlights.",
    "slug": "kosei-performance-partners",
    "images": {
      "thumbnail": {
        "url": "/projects/kosei-performance-partners/thumbnail.jpg",
        "alt": "Kosei Performance Partners website"
      },
      "gallery": []
    },
    "websiteUrl": "https://kosei-performance.webflow.io/",
    "featured": 4,
    "status": "published",
    "content": {
      "challenge": "Kosei Performance Partners needed a bold brand identity and website to reflect their mission of mentoring athletes and their Japanese-inspired name. The site had to feature detailed athlete profiles—stats like height, weight, age, status, and eligibility—to support international career pursuits, alongside partnerships and endorsements to attract players and collaborators in a competitive market.",
      "approach": "I led the branding and web development, designing a Kanji-inspired logo to anchor Kosei's distinct identity. Using Webflow, I built a responsive website with athlete profile pages featuring bios, stats, and video highlights, optimized for mobile use. A homepage benefits table highlighted Kosei's value, while partner logos and testimonials built trust.",
      "solution": "The final product was a visually striking and highly functional website, designed to support the athlete experience and business growth. Each athlete profile contained comprehensive details to help them secure international opportunities. The video highlights added an engaging layer, while the benefits table and endorsements strengthened Kosei's credibility.",
      "results": "The result was a visually striking, user-focused website I designed and developed to drive Kosei's mission. Each athlete profile delivered comprehensive, actionable details for international opportunities, enhanced by engaging video content. The benefits table and endorsements underscored Kosei's credibility, while the Japanese-themed branding set them apart."
    },
    "tools": [
      "adobe-illustrator",
      "adobe-photoshop",
      "figma",
      "html-css",
      "javascript",
      "webflow"
    ],
    "metadata": {
      "bgColor": "hsla(0, 1.59%, 9.84%, 1.00)",
      "mockupBgColor": "hsla(0, 0.00%, 96.08%, 1.00)"
    }
  },
  {
    "id": "5",
    "title": "Schmitt Automotive",
    "description": "Designed and developed a modern, cohesive brand identity and website for Schmitt Automotive—a specialized German car repair shop—boosting engagement and establishing trust through user-focused design and streamlined functionality.",
    "slug": "schmitt-automotive",
    "images": {
      "thumbnail": {
        "url": "/projects/schmitt-automotive/thumbnail.jpg",
        "alt": "Schmitt Automotive website"
      },
      "gallery": []
    },
    "websiteUrl": "https://www.schmittautomotive.com/",
    "featured": 5,
    "status": "published",
    "content": {
      "challenge": "Schmitt Automotive struggled with weak brand recognition and limited online engagement. Their inconsistent visuals and outdated website failed to reflect their expertise, making it hard to attract new customers. The booking process was clunky, discouraging interaction and stunting growth.",
      "approach": "As the lead designer and developer, I collaborated closely with the owner and potential clients through surveys and focus groups to uncover key needs: professionalism, trust, and convenience. My strategy focused on crafting a modern brand identity that screamed precision and expertise.",
      "solution": "I took full ownership of the project, delivering a sleek logo, consistent color palette, and typography guidelines that embodied Schmitt's high-quality service. Built a mobile-first, responsive site using modern tools, featuring subtle motion graphics, an intuitive layout, and a streamlined booking system coded from scratch.",
      "results": "The revamped brand and site delivered measurable success with a 40% increase in web traffic, with higher engagement via the new contact form. 25% rise in appointment requests within three months, thanks to the simplified booking process. Established Schmitt Automotive as a trusted leader in German car repair, strengthening their market presence."
    },
    "tools": [
      "adobe-illustrator",
      "adobe-photoshop",
      "figma",
      "webflow"
    ],
    "metadata": {
      "bgColor": "#0f0f0f",
      "mockupBgColor": "#0f0f0f"
    }
  },
  {
    "id": "6",
    "title": "Flourish",
    "description": "I designed and developed a responsive website for Flourish, a women's growth cohort built on the Townsend Leadership Program (TLP) framework. Starting with a personal coaching site for Natalie Dillow, I evolved it into a comprehensive platform for a team of three coaches, showcasing their expertise, the 10-month program, and a streamlined sign-up process.",
    "slug": "flourish",
    "images": {
      "thumbnail": {
        "url": "/projects/flourish/thumbnail.jpg",
        "alt": "Flourish website"
      },
      "gallery": []
    },
    "websiteUrl": "https://www.flourish-co.com/",
    "featured": 6,
    "status": "published",
    "content": {
      "challenge": "Natalie Dillow needed an initial website to launch her coaching practice, focusing on life transitions, relationships, and career growth with a sensitive, professional tone. As her vision expanded into Flourish, the site had to represent a multi-coach team, explain the cohort's structure and benefits, encourage sign-ups, and balance warmth with credibility to create a safe, supportive feel.",
      "approach": "I collaborated closely with Natalie to evolve the project in two phases. First, I designed and built a simple, responsive Webflow site with empathetic language, anonymized testimonials, and uplifting visuals of women in community. As Flourish emerged, I scaled the site with a \"Meet the Coaches\" section, detailed program information, and streamlined onboarding.",
      "solution": "I delivered a scalable, user-centric website for Flourish blending professionalism and warmth, with intuitive navigation for exploring the cohort, coaches, and sign-up process. Personalized touches like coach bios and testimonials built trust, while visuals of women connecting reflected Flourish's ethos.",
      "results": "The launch of the Flourish website marked a significant milestone with increased cohort enrollment through clear program details and an easy application process. The cohesive, warm design established Flourish as a credible, supportive community, and both the team and users praised the site's clarity and welcoming feel."
    },
    "tools": [
      "adobe-photoshop",
      "figma",
      "html-css",
      "webflow"
    ],
    "metadata": {
      "bgColor": "#c5cab2",
      "mockupBgColor": "#c5cab2"
    }
  },
  {
    "id": "7",
    "title": "River City Travel Ball",
    "description": "Designed a polished logo with variations and a CMS-driven website for River City Travel Ball, simplifying tournament management for a tech-light client while boosting sign-ups with a sporty, user-friendly frontend.",
    "slug": "river-city-travel-ball",
    "images": {
      "thumbnail": {
        "url": "/projects/river-city-travel-ball/thumbnail.jpg",
        "alt": "River City Travel Ball website"
      },
      "gallery": []
    },
    "websiteUrl": "http://www.rivercitytravelball.com/",
    "featured": 7,
    "status": "published",
    "content": {
      "challenge": "River City Travel Ball's owner needed a modern logo to replace an outdated design and a website to streamline hosting over 100 baseball tournaments. He required logo variations for different events and an easy-to-manage platform to handle team sign-ups, field locations, and extra details like hotel bookings—despite limited tech skills.",
      "approach": "I took charge of graphic design and website development, collaborating with the client to meet his needs. Crafted a sleek, sporty logo with multiple generic variations for tournament flexibility. Built a clean, engaging interface to showcase custom graphics and tournament info.",
      "solution": "I delivered a tailored solution with a polished logo with adaptable variations, plus custom visuals for each tournament—integrated into the CMS for easy assignment. Created a responsive frontend with Webflow, displaying team sign-ups, field details, hotel info, and score brackets.",
      "results": "The revamped site transformed their operations with 100+ events hosted, with the CMS streamlining team sign-ups and tournament updates. Increased sign-ups, drawing new participants and retaining repeat customers who value the site as a reliable resource. Enhanced ease of management, saving the owner time and effort while boosting his confidence."
    },
    "tools": [
      "adobe-illustrator",
      "adobe-photoshop",
      "figma",
      "webflow"
    ],
    "metadata": {
      "bgColor": "#01214e",
      "mockupBgColor": "hsla(33.749999999999986, 100.00%, 96.86%, 1.00)"
    }
  },
  {
    "id": "8",
    "title": "UCSC Transfer Admissions",
    "description": "In collaboration with a team of five undergraduate transfer students, we embarked on a mission to redesign the UCSC Transfer Admissions website. Our goal was to create a high-fidelity prototype that would later be transformed into a user-centric website. Through extensive research, interviews, usability testing, and wireframing, we identified pain-points and user needs, ultimately delivering four webpages that empowered transfer students with critical information.",
    "slug": "ucsc-transfer-admissions",
    "images": {
      "thumbnail": {
        "url": "/projects/ucsc-transfer-admissions/thumbnail.jpg",
        "alt": "UCSC Transfer Admissions website redesign"
      },
      "gallery": []
    },
    "websiteUrl": "https://admissions.ucsc.edu/transfer-students",
    "featured": 8,
    "status": "published",
    "content": {
      "challenge": "The UCSC Transfer Admissions website lacked a welcoming and user-friendly interface, hindering prospective and current transfer students from accessing vital information effortlessly. Our team of undergraduate transfer students faced the challenge of revamping the website to improve user experience, streamline the application process, and create a more inviting atmosphere for those seeking to join UCSC.",
      "approach": "We embarked on a comprehensive research phase, conducting interviews, usability testing, and heuristic evaluations to identify pain-points and user needs. Armed with valuable insights, we crafted user stories and designed paper prototypes to optimize information presentation. Our design goals focused on creating an intuitive timeline, incorporating visuals, and utilizing warm language to resonate with the target audience.",
      "solution": "Leveraging the data collected during research, we developed a high-fidelity prototype that addressed user needs and concerns. The redesigned website featured a welcoming homepage with appealing images and concise text. A user-friendly interface allowed students to track their transfer progress and find essential resources effortlessly. Testimonials and warm language fostered a deeper connection with prospective students, advisors, and parents.",
      "results": "The transformative UCSC Transfer Admissions website garnered positive feedback and tangible results. Prospective students found the platform more accessible and informative, leading to increased user engagement. The intuitive timeline kept students well-informed about critical dates and deadlines. Streamlined navigation empowered transfer students to access resources effortlessly, while the incorporation of visuals and warm language fostered a sense of belonging within the UCSC community."
    },
    "tools": [
      "figma",
      "html-css"
    ],
    "metadata": {
      "bgColor": "#0075f4",
      "mockupBgColor": "hsla(211.83673469387756, 100.00%, 48.04%, 1.00)"
    }
  },
  {
    "id": "9",
    "title": "Aletheia Digital Media",
    "description": "Redesigned the website for Aletheia Digital Media as my first project as an employee, crafting a vibrant, user-centered platform with interactive prototypes and custom visuals—kickstarting a lasting partnership.",
    "slug": "aletheia-digital-media",
    "images": {
      "thumbnail": {
        "url": "/projects/aletheia-digital-media/thumbnail.jpg",
        "alt": "Aletheia Digital Media website"
      },
      "gallery": []
    },
    "websiteUrl": "https://www.aletheiadigitalmedia.com",
    "featured": 9,
    "status": "published",
    "content": {
      "challenge": "Aletheia Digital Media, a video production and digital marketing agency, needed a modern website to reflect their expertise and diverse services. As my first task as a new employee, I aimed to revamp their outdated online presence into a dynamic showcase that aligned with their brand and captivated clients.",
      "approach": "I collaborated closely with the founders and operations director, diving into their vision and needs. My process included creating wireframes and interactive prototypes to map a clear site structure—home, about, services, work, and products. I developed visual assets like custom icons and motion graphics, inspired by their circular logo and multi-color scheme.",
      "solution": "I delivered a polished, brand-aligned website with a cohesive look featuring circle motifs, vibrant graphics, and a logo motion graphic reflecting their video expertise. Built a responsive, user-friendly layout with custom CSS guidelines for consistency across typography, buttons, and links. Structured a simple backend for staff to manage content, showcasing past work and services.",
      "results": "The redesign boosted Aletheia's impact with increased leads and engagement, with clients praising the site's usability and vibrant appeal. Enhanced credibility through a stunning portfolio display, opening new opportunities. The owner and team were thrilled with the fresh look, cementing a partnership I maintain as a freelancer—designing for their clients and updating the site."
    },
    "tools": [
      "figma",
      "adobe-illustrator",
      "webflow"
    ],
    "metadata": {
      "bgColor": "#660f88",
      "mockupBgColor": "hsla(202, 63.83%, 63.14%, 1.00)"
    }
  },
  {
    "id": "10",
    "title": "Chiropractic Healthcare",
    "description": "I was tasked with creating a website for a chiropractic clinic that had previously only had a presence on Google Business. Through research and iteration on the design, I was able to create a website that matched the clinic's brand identity and provided users with clear, concise information about the services offered at the clinic.",
    "slug": "chiropractic-healthcare",
    "images": {
      "thumbnail": {
        "url": "/projects/chiropractic-healthcare/thumbnail.jpg",
        "alt": "Chiropractic Healthcare website"
      },
      "gallery": []
    },
    "websiteUrl": "https://www.petrillichiropractic.com/",
    "featured": 10,
    "status": "published",
    "content": {
      "challenge": "Dr. Petrilli owned a chiropractic clinic that had been in operation for several years. While the business had a strong presence on Google Business, it did not have a website. As a result, Dr. Petrilli was missing out on the opportunity to reach a wider audience and provide potential patients with more information about his services. The objective of this project was to create a website for Chiropractic Healthcare that would allow new patients to contact the business for chiropractic care.",
      "approach": "First, I conducted a competitor analysis of the most successful chiropractors, both locally and nationally. This allowed me to understand the aesthetic standards for chiropractic websites and identify areas where the clinic could stand out from its competitors. I also researched industry trends and interviewed the receptionist to get a better understanding of the information that users needed to get started with chiropractic care.",
      "solution": "I aimed to make the website feel simple and professional for those seeking medical help for health issues. To achieve this, I kept the design clean and minimalistic, and used easy-to-read fonts and plenty of white space. With limited branding to work with, my goal for the website's design was to establish a strong brand identity for the chiropractic clinic using their famous red sign for inspiration including the font and color to create a logo and an interactive loading animation.",
      "results": "The website for the chiropractic clinic has had a significant impact on the business since its launch. It has received over 16 website views per week, with an average of 2 conversions each month. These conversions represent users who have contacted the business through the contact form, booked an appointment, and paid for their services. The website has received positive feedback from both my client and his staff, who have noticed an increase in calls and inquiries through the website and their Google Business profile."
    },
    "tools": [
      "adobe-illustrator",
      "figma",
      "webflow"
    ],
    "metadata": {
      "bgColor": "#7e0a0a",
      "mockupBgColor": "hsla(27.272727272727202, 12.64%, 82.94%, 1.00)"
    }
  },
  {
    "id": "11",
    "title": "Trenchless Pros",
    "description": "Trenchless Pros required a clean and informative website to showcase their expertise in trenchless sewer solutions. The project successfully delivered a visually appealing logo, vector graphics, and motion graphics, creating an engaging and user-friendly website that effectively communicated their services and benefits.",
    "slug": "trenchless-pros",
    "images": {
      "thumbnail": {
        "url": "/projects/trenchless-pros/thumbnail.jpg",
        "alt": "Trenchless Pros website"
      },
      "gallery": []
    },
    "websiteUrl": "https://trenchless-pros.webflow.io/",
    "featured": 11,
    "status": "published",
    "content": {
      "challenge": "Trenchless Pros faced the challenge of establishing a strong online presence without any real photos of their workers or technology. They needed a website that could explain their trenchless sewer expertise clearly and engagingly. Key requirements included a simple, clean logo, vector graphics, motion graphics to explain their processes, and a user-friendly interface.",
      "approach": "To address these challenges, I undertook a comprehensive design and development approach. Firstly, I created a simple yet impactful logo that represented Trenchless Pros' professionalism. Next, I developed vector graphics and motion graphics to visually explain the trenchless sewer process. For the \"How It Works\" section, I designed an engaging motion graphic where an animated camera looks through a pipe underground, highlighting common problems found using trenchless methods.",
      "solution": "The solution provided to Trenchless Pros was a visually appealing and informative website. The logo and vector graphics created a clean and professional look. The motion graphics in the \"How It Works\" section enhanced user engagement and understanding of the trenchless sewer process. The website included an About section to introduce the company, a Testimonials section to build credibility, and a Contact form to facilitate free estimate requests.",
      "results": "Following the launch of the new website, Trenchless Pros experienced several positive outcomes. The visually engaging and informative website effectively communicated their expertise and services. The motion graphics and vector images helped explain the trenchless process clearly, leading to increased user engagement and understanding. The inclusion of testimonials built trust and credibility with potential clients. The contact form facilitated easy scheduling of free estimates, resulting in more inquiries and client interactions."
    },
    "tools": [
      "adobe-illustrator",
      "figma",
      "webflow",
      "html-css"
    ],
    "metadata": {
      "bgColor": "#0072bd",
      "mockupBgColor": ""
    }
  }
]